# SubregionOverlap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..SubregionOverlap Property
BuiltInFailures..::..OverlapFailures Class See Also
---
Highlighted sub-division overlap.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SubregionOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SubregionOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SubregionOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace